{"datetime": "2023-12-11 13:07:09", "problem_type": "cls", "target": "CLS_TARGET", "features": ["open_line", "rest_diff_hv", "day_of_season", "last_5_hv", "streak_hv", "point_diff_last_5_hv", "point_diff_hv", "win_pct_hv", "pie_percentile_away_all_advanced", "home_team_avg_point_diff", "net_rating_away_all_advanced", "net_rating_home_all_advanced", "plus_minus_home_all_traditional", "e_net_rating_zscore_away_all_advanced", "net_rating_zscore_away_all_advanced", "plus_minus_away_all_opponent", "away_team_avg_point_diff", "plus_minus_away_all_traditional", "pie_zscore_away_all_advanced", "e_net_rating_away_all_advanced", "plus_minus_percentile_away_all_traditional", "net_rating_zscore_home_l2w_advanced", "e_net_rating_home_all_advanced", "w_zscore_away_all_traditional", "pie_away_all_advanced", "w_pct_zscore_away_all_traditional", "e_net_rating_percentile_away_l2w_advanced"], "training_start_date": "2020-12-22", "training_end_date": "2022-04-10", "testing_start_date": "2022-10-18", "testing_end_date": "2023-04-09", "training_df_shape": [2353, 29], "testing_df_shape": [1214, 29], "ind_baseline_train": 0.4793880152996175, "ind_baseline_test": 0.5049423393739704, "dep_baseline_train": 0.5206119847003825, "dep_baseline_test": 0.4950576606260296, "details": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float64", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "autokeras.keras_layers", "class_name": "MultiCategoryEncoding", "config": {"name": "multi_category_encoding", "trainable": true, "dtype": "float32", "encoding": ["int", "int", "none", "int", "int", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none"]}, "registered_name": "Custom>MultiCategoryEncoding", "build_config": {"input_shape": [null, 27]}, "name": "multi_category_encoding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "dtype": "float32", "axis": [-1], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 27]}, "name": "normalization", "inbound_nodes": [[["multi_category_encoding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 27]}, "name": "dense", "inbound_nodes": [[["normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 16]}, "name": "dropout", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 16]}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dropout_1", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "classification_head_1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "name": "classification_head_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["classification_head_1", 0, 0]]}, "train_accuracy": 0.5350616234594135, "train_auc": 0.5419434795194673, "test_accuracy": 0.5189456342668863, "test_auc": 0.5149302549041429, "roi_all_bets_even_amount_avg": 3.79, "roi_all_bets_typical_odds_avg": -0.88, "roi_cutoff_50_even_odds_avg": 3.79, "roi_cutoff_50_typical_odds_avg": -0.88, "roi_cutoff_55_even_odds_avg": 8.41, "roi_cutoff_55_typical_odds_avg": 3.53, "roi_cutoff_60_even_odds_avg": 0.0, "roi_cutoff_60_typical_odds_avg": -4.5, "roi_cutoff_65_even_odds_avg": 0.0, "roi_cutoff_65_typical_odds_avg": 0.0, "roi_cutoff_70_even_odds_avg": 0.0, "roi_cutoff_70_typical_odds_avg": 0.0, "roi_all_bets_even_amount_kelly_criterion_avg": 3.68, "roi_all_bets_typical_odds_kelly_criterion_avg": -0.99, "platform": "autokeras", "model_type": "dl", "model_id": "autokeras_cls_dl_2023_12_11_13_07_09"}
{"datetime": "2023-12-11 14:22:24", "problem_type": "reg", "target": "REG_TARGET", "features": ["open_line", "rest_diff_hv", "day_of_season", "last_5_hv", "streak_hv", "point_diff_last_5_hv", "point_diff_hv", "win_pct_hv", "pie_percentile_away_all_advanced", "home_team_avg_point_diff", "net_rating_away_all_advanced", "net_rating_home_all_advanced", "plus_minus_home_all_traditional", "e_net_rating_zscore_away_all_advanced", "net_rating_zscore_away_all_advanced", "plus_minus_away_all_opponent", "away_team_avg_point_diff", "plus_minus_away_all_traditional", "pie_zscore_away_all_advanced", "e_net_rating_away_all_advanced", "plus_minus_percentile_away_all_traditional", "net_rating_zscore_home_l2w_advanced", "e_net_rating_home_all_advanced", "w_zscore_away_all_traditional", "pie_away_all_advanced", "w_pct_zscore_away_all_traditional", "e_net_rating_percentile_away_l2w_advanced"], "training_start_date": "2020-12-22", "training_end_date": "2022-04-10", "testing_start_date": "2022-10-18", "testing_end_date": "2023-04-09", "training_df_shape": [2353, 30], "testing_df_shape": [1214, 30], "ind_baseline_train": 10.685932851678707, "ind_baseline_test": 9.77512355848435, "dep_baseline_train": 12.202794526396934, "dep_baseline_test": 10.996366585893014, "details": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float64", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "autokeras.keras_layers", "class_name": "MultiCategoryEncoding", "config": {"name": "multi_category_encoding", "trainable": true, "dtype": "float32", "encoding": ["int", "int", "none", "int", "int", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none", "none"]}, "registered_name": "Custom>MultiCategoryEncoding", "build_config": {"input_shape": [null, 27]}, "name": "multi_category_encoding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 27]}, "name": "dense", "inbound_nodes": [[["multi_category_encoding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "dense_1", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "regression_head_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "regression_head_1", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["regression_head_1", 0, 0]]}, "train_mae": 10.86324113110754, "train_r2": 0.1741491599887982, "test_mae": 10.328353056116445, "test_r2": 0.09411681426503371, "train_acc_reg": 0.5235869103272418, "test_acc_reg": 0.5115321252059308, "train_ctt": 0.48066298342541436, "test_ctt": 0.4538714991762768, "roi_all_bets_even_amount_avg": 2.31, "roi_all_bets_typical_odds_avg": -2.3, "platform": "autokeras", "model_type": "dl", "model_id": "autokeras_reg_dl_2023_12_11_14_22_24"}
{"datetime": "2023-12-11 14:28:03", "problem_type": "cls", "target": "CLS_TARGET", "features": ["open_line", "rest_diff_hv", "day_of_season", "last_5_hv", "streak_hv", "point_diff_last_5_hv", "point_diff_hv", "win_pct_hv", "pie_percentile_away_all_advanced", "home_team_avg_point_diff", "net_rating_away_all_advanced", "net_rating_home_all_advanced", "plus_minus_home_all_traditional", "e_net_rating_zscore_away_all_advanced", "net_rating_zscore_away_all_advanced", "plus_minus_away_all_opponent", "away_team_avg_point_diff", "plus_minus_away_all_traditional", "pie_zscore_away_all_advanced", "e_net_rating_away_all_advanced", "plus_minus_percentile_away_all_traditional", "net_rating_zscore_home_l2w_advanced", "e_net_rating_home_all_advanced", "w_zscore_away_all_traditional", "pie_away_all_advanced", "w_pct_zscore_away_all_traditional", "e_net_rating_percentile_away_l2w_advanced"], "training_start_date": "2020-12-22", "training_end_date": "2022-04-10", "testing_start_date": "2022-10-18", "testing_end_date": "2023-04-09", "training_df_shape": [2353, 29], "testing_df_shape": [1214, 29], "ind_baseline_train": 0.4793880152996175, "ind_baseline_test": 0.5049423393739704, "dep_baseline_train": 0.5206119847003825, "dep_baseline_test": 0.4950576606260296, "details": {"priors": null, "var_smoothing": 1e-09}, "train_accuracy": 0.5266, "train_auc": 0.5294, "test_accuracy": 0.5206, "test_auc": 0.5162, "roi_all_bets_even_amount_avg": 4.12, "roi_all_bets_typical_odds_avg": -0.57, "roi_cutoff_50_even_odds_avg": 4.12, "roi_cutoff_50_typical_odds_avg": -0.57, "roi_cutoff_55_even_odds_avg": 5.23, "roi_cutoff_55_typical_odds_avg": 0.49, "roi_cutoff_60_even_odds_avg": 3.38, "roi_cutoff_60_typical_odds_avg": -1.27, "roi_cutoff_65_even_odds_avg": 1.27, "roi_cutoff_65_typical_odds_avg": -3.29, "roi_cutoff_70_even_odds_avg": -4.05, "roi_cutoff_70_typical_odds_avg": -8.37, "roi_all_bets_even_amount_kelly_criterion_avg": 3.07, "roi_all_bets_typical_odds_kelly_criterion_avg": -1.57, "platform": "pycaret", "model_type": "nb", "model_id": "pycaret_cls_nb_2023_12_11_14_28_03"}
{"datetime": "2023-12-11 14:43:17", "problem_type": "reg", "target": "REG_TARGET", "features": ["open_line", "rest_diff_hv", "day_of_season", "last_5_hv", "streak_hv", "point_diff_last_5_hv", "point_diff_hv", "win_pct_hv", "pie_percentile_away_all_advanced", "home_team_avg_point_diff", "net_rating_away_all_advanced", "net_rating_home_all_advanced", "plus_minus_home_all_traditional", "e_net_rating_zscore_away_all_advanced", "net_rating_zscore_away_all_advanced", "plus_minus_away_all_opponent", "away_team_avg_point_diff", "plus_minus_away_all_traditional", "pie_zscore_away_all_advanced", "e_net_rating_away_all_advanced", "plus_minus_percentile_away_all_traditional", "net_rating_zscore_home_l2w_advanced", "e_net_rating_home_all_advanced", "w_zscore_away_all_traditional", "pie_away_all_advanced", "w_pct_zscore_away_all_traditional", "e_net_rating_percentile_away_l2w_advanced"], "training_start_date": "2020-12-22", "training_end_date": "2022-04-10", "testing_start_date": "2022-10-18", "testing_end_date": "2023-04-09", "training_df_shape": [2353, 30], "testing_df_shape": [1214, 30], "ind_baseline_train": 10.685932851678707, "ind_baseline_test": 9.77512355848435, "dep_baseline_train": 12.202794526396934, "dep_baseline_test": 10.996366585893014, "details": {"alpha": 1.2, "copy_X": true, "fit_intercept": true, "max_iter": 1000, "positive": false, "precompute": false, "random_state": 2658, "selection": "cyclic", "tol": 0.0001, "warm_start": false}, "train_mae": 10.66919994354248, "train_r2": 0.2063, "test_mae": 9.80840015411377, "test_r2": 0.165, "train_acc_reg": 0.5214619634509138, "test_acc_reg": 0.471993410214168, "train_ctt": 0.5180620484487888, "test_ctt": 0.4670510708401977, "roi_all_bets_even_amount_avg": -5.6, "roi_all_bets_typical_odds_avg": -9.85, "platform": "pycaret", "model_type": "lasso", "model_id": "pycaret_reg_lasso_2023_12_11_14_43_17"}
